src/Catalogs/ПрограммыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПрограммыОбучения</Name>
			<Comment>Перечень программ среднего профессионального образования, по которым образовательная организация ведет образовательную деятельность.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовоеОбразование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбразований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛетОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцевОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбученияСлитно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСрокаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Квалификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Квалификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПрограммыОбучения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СрокОбученияПриИзменении(Элемент)
	Объект.СрокОбученияСлитно = "" + Объект.ЛетОбучения + " года " + Объект.МесяцевОбучения + " месяцев";
КонецПроцедуры

&НаКлиенте
Процедура СрокОбученияСлитноПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ЛетОбучения = НайтиЧислаВСтроке(Объект.СрокОбученияСлитно, 0);
	Объект.МесяцевОбучения = НайтиЧислаВСтроке(Объект.СрокОбученияСлитно, 1);
КонецПроцедуры

Функция НайтиЧислаВСтроке(Строка, Номер)
   МассивЧисел = Новый Массив; // сюда поместим все найденные числа
   СтрокаЧисел = "";
   Для Индекс = 1 По СтрДлина(Строка) Цикл
      Символ = Сред(Строка, Индекс, 1); // Перебираем все символы из нашей строки
      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
         МассивЧисел.Добавить(Число(СтрокаЧисел));
         СтрокаЧисел = "";
      КонецЕсли;
   КонецЦикла;
   Возврат МассивЧисел[Номер]
КонецФункции

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если Объект.Действует = Истина 
		Тогда ЭтаФорма.ЭтотОбъект.Элементы.НачалоСрокаОбучения.Доступность = Истина;
	Иначе 
		ЭтаФорма.ЭтотОбъект.Элементы.НачалоСрокаОбучения.Доступность = Ложь;
		Объект.НачалоСрокаОбучения = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ЭтаФорма.ЭтотОбъект.Элементы.НачалоСрокаОбучения.Доступность = Ложь;
КонецПроцедуры
